In [29]:
import numpy as np

In [30]:
import pandas as pd

In [31]:
df_rotten = pd.read_csv('data/zippedData/rotten_tomatoes_movies.csv.gz')
df_rotten.head()
df_rotten.value_counts('genres')

genres
Drama                                                                                       1887
Comedy                                                                                      1263
Comedy, Drama                                                                                863
Drama, Mystery & Suspense                                                                    731
Art House & International, Drama                                                             589
                                                                                            ...
Classics, Documentary, Special Interest                                                        1
Classics, Documentary, Sports & Fitness                                                        1
Action & Adventure, Art House & International, Classics, Mystery & Suspense                    1
Classics, Drama, Horror, Musical & Performing Arts, Mystery & Suspense, Special Interest       1
Art House & International, Kids & Family, Science Fiction & Fantasy                            1
Length: 1106, dtype: int64

In [32]:
df_rotten_relev = df_rotten[['movie_title', 'genres', 'content_rating', 'tomatometer_rating', 'tomatometer_count', 'audience_rating', 'audience_count', 'tomatometer_top_critics_count']]
df_rotten_relev

,movie_title,genres,content_rating,tomatometer_rating,tomatometer_count,audience_rating,audience_count,tomatometer_top_critics_count
0,Percy Jackson & the Olympians: The Lightning T...,"Action & Adventure, Comedy, Drama, Science Fic...",PG,49.0,149.0,53.0,254421.0,43
1,Please Give,Comedy,R,87.0,142.0,64.0,11574.0,44
2,10,"Comedy, Romance",R,67.0,24.0,53.0,14684.0,2
3,12 Angry Men (Twelve Angry Men),"Classics, Drama",NR,100.0,54.0,97.0,105386.0,6
4,"20,000 Leagues Under The Sea","Action & Adventure, Drama, Kids & Family",G,89.0,27.0,74.0,68918.0,5
...,...,...,...,...,...,...,...,...
17707,Zoot Suit,"Drama, Musical & Performing Arts",R,56.0,9.0,74.0,1195.0,2
17708,Zootopia,"Action & Adventure, Animation, Comedy",PG,98.0,291.0,92.0,101511.0,50
17709,Zorba the Greek,"Action & Adventure, Art House & International,...",NR,80.0,10.0,86.0,7146.0,0
17710,Zulu,"Classics, Drama",PG,96.0,23.0,91.0,30193.0,6
17711,Zulu Dawn,"Action & Adventure, Art House & International,...",PG,50.0,8.0,62.0,4469.0,0

In [41]:
df_budgets = pd.read_csv('data/zippedData/tn.movie_budgets.csv.gz')
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [42]:
df_budgets['production_budget'] = df_budgets['production_budget'].str.replace('$', '')
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].str.replace('$', '')
df_budgets['production_budget'] = df_budgets['production_budget'].str.replace(',', '')
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].str.replace(',', '')
df_budgets.head()

<ipython-input-42-c2b0115470cc>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df_budgets['production_budget'] = df_budgets['production_budget'].str.replace('$', '')
<ipython-input-42-c2b0115470cc>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df_budgets['domestic_gross'] = df_budgets['domestic_gross'].str.replace('$', '')

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,"$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,"$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,"$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,"$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,"$1,316,721,747"

In [43]:
df_budgets[['domestic_gross', 'production_budget']] = df_budgets[['domestic_gross', 'production_budget']].apply(pd.to_numeric)
df_budgets = df_budgets.drop(columns="worldwide_gross")
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382

In [44]:
df_budgets["profit"] = df_budgets["domestic_gross"] - df_budgets["production_budget"]
df_budgets

,id,release_date,movie,production_budget,domestic_gross,profit
0,1,"Dec 18, 2009",Avatar,425000000,760507625,335507625
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,-169536125
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,-307237650
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,128405868
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,303181382
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,7000,0,-7000
5778,79,"Apr 2, 1999",Following,6000,48482,42482
5779,80,"Jul 13, 2005",Return to the Land of Wonders,5000,1338,-3662
5780,81,"Sep 29, 2015",A Plague So Pleasant,1400,0,-1400
5781,82,"Aug 5, 2005",My Date With Drew,1100,181041,179941

In [57]:
def getSeason(release_date):
    month = release_date[:3]
    if month in ['Dec', 'Jan', 'Feb']:
        return 'Winter'
    elif month in ['Mar', 'Apr', 'May']:
        return 'Spring'
    elif month in ['Jun', 'Jul', 'Aug']:
        return 'Summer'
    else: 
        return 'Fall'

In [58]:
df_budgets['season'] = df_budgets['release_date'].apply(getSeason)

In [59]:
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,profit,season
0,1,"Dec 18, 2009",Avatar,425000000,760507625,335507625,Winter
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,-169536125,Spring
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,-307237650,Summer
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,128405868,Spring
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,303181382,Winter

In [62]:
def getYear(release_date):
Â Â Â Â if release_date[8:12] == 2016:
Â Â Â Â Â Â Â Â return 2016
Â Â Â Â if (release_date[7:11] == 2017):
Â Â Â Â Â Â Â Â return 2017
Â Â Â Â if (release_date[7:11] == 2018):
Â Â Â Â Â Â Â Â return 2018
Â Â Â Â if (release_date[7:11] == 2019):
Â Â Â Â Â Â Â Â return 2019
Â Â Â Â if (release_date[7:11] == 2020):
Â Â Â Â Â Â Â Â return 2020
Â Â Â Â if (release_date[7:11] == 2021):
Â Â Â Â Â Â Â Â return 2021
Â Â Â Â else:
Â Â Â Â Â Â Â Â return None
year = df_budgets.release_date.apply(getYear)
df_budgets['Year'] = year
df_budgets

SyntaxError: invalid character in identifier (<ipython-input-62-6314fd6da1d0>, line 2)